app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "release_year", "album_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Ten"], ["release_year", 1991], ["album_url", "https://imgur.com/cXWthLt"], ["user_id", 4], ["created_at", "2021-03-31 18:59:10.354399"], ["updated_at", "2021-03-31 18:59:10.354399"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Ride the Lightnin"], ["updated_at", "2021-04-01 18:22:41.681082"], ["id", 16]]
---
  def update
    if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 13]]
---
  def destroy
    @album.destroy

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_album
      @album = Album.find(params[:id])