app/controllers/reviews_controller.rb

  def create
    @album = Album.find(params[:album_id])
    @review = Review.new(review_params)
    @review.album = @album
    @review.user = @current_user

    if @review.save
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "reviews" ("review", "user_id", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["review", "This slaps"], ["user_id", 4], ["album_id", 9], ["created_at", "2021-03-31 21:19:43.546831"], ["updated_at", "2021-03-31 21:19:43.546831"]]